hurrican/wbci-acceptance-test/src/citrus/resources/de/mnet/wbci/acceptance/donating/cdm/v1/VaKueMrnAbgAutoProcessing_01/ABBM.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <ns0:updateCarrierChange xmlns:ns0="http://www.mnet.de/esb/cdm/SupplierPartner/CarrierNegotiationService/v1">
            <ns0:ABBM>
                <ns0:absender>
                    <ns0:carrierCode>${carrierCodeAbg}</ns0:carrierCode>
                </ns0:absender>
                <ns0:empfaenger>
                    <ns0:carrierCode>${carrierCodeAuf}</ns0:carrierCode>
                </ns0:empfaenger>
                <ns0:version>0</ns0:version>
                <ns0:vorabstimmungsIdRef>${preAgreementId}</ns0:vorabstimmungsIdRef>
                <ns0:endkundenvertragspartner>
                    <ns0:EKPauf>
                        <ns0:carrierCode>${carrierCodeAuf}</ns0:carrierCode>
                    </ns0:EKPauf>
                    <ns0:EKPabg>
                        <ns0:carrierCode>${carrierCodeAbg}</ns0:carrierCode>
                    </ns0:EKPabg>
                </ns0:endkundenvertragspartner>
                <ns0:geschaeftsfall>VA-KUE-MRN</ns0:geschaeftsfall>
                <ns0:position>
                    <ns0:Meldungscode>@sim:containedInList('8115,8116')@</ns0:Meldungscode>
                    <ns0:Meldungstext>@sim:containedInList('Vorabstimmungs-,Terminverschiebungs-,Storno-, ID wird bereits verwendet.|Sonstiges(|)')@</ns0:Meldungstext>
                </ns0:position>
                <ns0:position>
                    <ns0:Meldungscode>@sim:containedInList('8115,8116')@</ns0:Meldungscode>
                    <ns0:Meldungstext>@sim:containedInList('Vorabstimmungs-,Terminverschiebungs-,Storno-, ID wird bereits verwendet.|Sonstiges(|)')@</ns0:Meldungstext>
                </ns0:position>
                <ns0:begruendung>Eine aktive Vorabstimmung mit der VA-ID: ${preAgreementId} ist bereits vorhanden</ns0:begruendung>
            </ns0:ABBM>
        </ns0:updateCarrierChange>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>